In [31]:
people = {
            'first': ['Corey', 'John', 'Jane'],
            'last' : ['Schafer', 'Doe', 'Doe'],
            'email': ['CoreySchafer@gmaicom', 'JohnDoe@gmail.com', 'JaneDoe@gmail.com']
}

In [32]:
import pandas as pd

In [33]:
df= pd.DataFrame(people)

In [34]:
df

   first     last                 email
0  Corey  Schafer  CoreySchafer@gmaicom
1   John      Doe     JohnDoe@gmail.com
2   Jane      Doe     JaneDoe@gmail.com

In [35]:
#To concatenate two series(columns) together in the datafarame
df['first']+' '+ df['last']

0    Corey Schafer
1         John Doe
2         Jane Doe
dtype: object

In [36]:
df['full_name'] = df['first']+' '+ df['last']

In [37]:
df

   first     last                 email      full_name
0  Corey  Schafer  CoreySchafer@gmaicom  Corey Schafer
1   John      Doe     JohnDoe@gmail.com       John Doe
2   Jane      Doe     JaneDoe@gmail.com       Jane Doe

In [126]:
#We could also remove columns within the dataframe
df.drop(columns= [ 'first', 'last']) #Note the output of this command only gives us a view of how our dataframe would look like after the drop command is implemented.

                  email      full_name
0  CoreySchafer@gmaicom  Corey Schafer
1     JohnDoe@gmail.com       John Doe
2     JaneDoe@gmail.com       Jane Doe

In [127]:
#To effect this one our dataframe we could either use the inplace command or assign the drop command line to the original dataframe.

In [128]:
#df = df.drop(columns= [ 'first', 'last'])
df.drop(columns= [ 'first', 'last'], inplace= True)

In [129]:
df

                  email      full_name
0  CoreySchafer@gmaicom  Corey Schafer
1     JohnDoe@gmail.com       John Doe
2     JaneDoe@gmail.com       Jane Doe

In [130]:
#We could reverse this process (the process of removing the first and last names from the dataframe)
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [John, Doe]
2         [Jane, Doe]
Name: full_name, dtype: object

In [131]:
#To express this in a dataframe format we would use the expand function perculiar to pandas
df['full_name'].str.split(' ', expand= True)

       0        1
0  Corey  Schafer
1   John      Doe
2   Jane      Doe

In [132]:
#Now we could assign the expanded columns to our previous first and last name columns
df[['first', 'last']]= df['full_name'].str.split(' ', expand= True)

In [133]:
df

                  email      full_name  first     last
0  CoreySchafer@gmaicom  Corey Schafer  Corey  Schafer
1     JohnDoe@gmail.com       John Doe   John      Doe
2     JaneDoe@gmail.com       Jane Doe   Jane      Doe

## Adding rows to a dataframe

In [134]:
#This can be done in two way
#Either by appending two rows, already present in the dataframe, together to form a new one
#Or add a single row of new data into the dataframe

In [135]:
#Adding a single row of data
#This can also be done in two ways
#1. Is by ignoring the the index of the row using the ignore_index= True command
#2. if the series already have a name or already exist. ie another dataframe

df.append({'first': 'Tony'}, ignore_index= True) #Here we used the ignore command to add a row to the dataframe

C:\Users\USER\AppData\Local\Temp\ipykernel_8316\4102091149.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'Tony'}, ignore_index= True) #Here we used the ignore command to add a row to the dataframe

                  email      full_name  first     last
0  CoreySchafer@gmaicom  Corey Schafer  Corey  Schafer
1     JohnDoe@gmail.com       John Doe   John      Doe
2     JaneDoe@gmail.com       Jane Doe   Jane      Doe
3                   NaN            NaN   Tony      NaN

In [136]:
people = {
            'first': ['Tony', 'Steve'],
            'last' : ['Stark', 'Rogers'],
            'email': ['IronMan@gmaicom', 'Cap@gmail.com']
}

In [137]:
df2= pd.DataFrame(people)

In [138]:
df2

   first    last            email
0   Tony   Stark  IronMan@gmaicom
1  Steve  Rogers    Cap@gmail.com

In [139]:
df.append(df2, ignore_index= True, sort= False) #Adding by appending another dataframe into the existing one

C:\Users\USER\AppData\Local\Temp\ipykernel_8316\628418118.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index= True, sort= False) #Adding by appending another dataframe into the existing one

                  email      full_name  first     last
0  CoreySchafer@gmaicom  Corey Schafer  Corey  Schafer
1     JohnDoe@gmail.com       John Doe   John      Doe
2     JaneDoe@gmail.com       Jane Doe   Jane      Doe
3       IronMan@gmaicom            NaN   Tony    Stark
4         Cap@gmail.com            NaN  Steve   Rogers

In [140]:
df= df.append(df2, ignore_index= True, sort= False)

C:\Users\USER\AppData\Local\Temp\ipykernel_8316\1677441319.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df= df.append(df2, ignore_index= True, sort= False)

In [141]:
df

                  email      full_name  first     last
0  CoreySchafer@gmaicom  Corey Schafer  Corey  Schafer
1     JohnDoe@gmail.com       John Doe   John      Doe
2     JaneDoe@gmail.com       Jane Doe   Jane      Doe
3       IronMan@gmaicom            NaN   Tony    Stark
4         Cap@gmail.com            NaN  Steve   Rogers

In [142]:
#Another way of achieving this:
#result= pd.concat([df, df2], ignore_index= True, sort= False) #The concat command is the most recent way of appending two dataframes in pandas
#result

## Removing Rows

In [144]:
#Removing a specific row from the dataframe using it's index
df.drop(index= 4)

                  email      full_name  first     last
0  CoreySchafer@gmaicom  Corey Schafer  Corey  Schafer
1     JohnDoe@gmail.com       John Doe   John      Doe
2     JaneDoe@gmail.com       Jane Doe   Jane      Doe
3       IronMan@gmaicom            NaN   Tony    Stark

In [145]:
#We could also remove specific row from the dataframe using conditions
filt = (df['last']== 'Doe')
df.drop(index= df[filt].index)

                  email      full_name  first     last
0  CoreySchafer@gmaicom  Corey Schafer  Corey  Schafer
3       IronMan@gmaicom            NaN   Tony    Stark
4         Cap@gmail.com            NaN  Steve   Rogers

In [38]:
#Exercise
df['Age']= {0: 13, 1:16, 2:18}

In [39]:
df

   first     last                 email      full_name  Age
0  Corey  Schafer  CoreySchafer@gmaicom  Corey Schafer   13
1   John      Doe     JohnDoe@gmail.com       John Doe   16
2   Jane      Doe     JaneDoe@gmail.com       Jane Doe   18

In [40]:
df.append({'first': 'Mark', 'last': 'Bishop', 'email': 'MarkBish@gmail.com', 'Age': '19'}, ignore_index= True, sort= False)

C:\Users\USER\AppData\Local\Temp\ipykernel_8048\585238165.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'Mark', 'last': 'Bishop', 'email': 'MarkBish@gmail.com', 'Age': '19'}, ignore_index= True, sort= False)

   first     last                 email      full_name Age
0  Corey  Schafer  CoreySchafer@gmaicom  Corey Schafer  13
1   John      Doe     JohnDoe@gmail.com       John Doe  16
2   Jane      Doe     JaneDoe@gmail.com       Jane Doe  18
3   Mark   Bishop    MarkBish@gmail.com            NaN  19

In [41]:
df= df.append({'first': 'Mark', 'last': 'Bishop', 'email': 'MarkBish@gmail.com', 'Age': '19'}, ignore_index= True, sort= False)

C:\Users\USER\AppData\Local\Temp\ipykernel_8048\684713198.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df= df.append({'first': 'Mark', 'last': 'Bishop', 'email': 'MarkBish@gmail.com', 'Age': '19'}, ignore_index= True, sort= False)

In [42]:
fullname= df.loc[3, 'first']+' '+df.loc[3, 'last']

In [43]:
fullname

'Mark Bishop'

In [44]:
df.loc[3, 'full_name'] = fullname

In [45]:
df

   first     last                 email      full_name Age
0  Corey  Schafer  CoreySchafer@gmaicom  Corey Schafer  13
1   John      Doe     JohnDoe@gmail.com       John Doe  16
2   Jane      Doe     JaneDoe@gmail.com       Jane Doe  18
3   Mark   Bishop    MarkBish@gmail.com    Mark Bishop  19